<template>
  <tab-content :title="'สรุปข้อมูล'">
    <div class="row" v-if="tab_index == 2">
      <div class="col-md-12">
        <div class="row">
          <div class="col-md-12 mb-5">
            <h4>3.1 ข้อมูลผู้{{ complaint_type.name_th }}</h4>
          </div>
          <div class="col-md-6">
            <span class="fw-bold">ประเภทการระบุตัวตน : </span>
            <span class="fst-italic">{{ new_item.is_anonymous?.name }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-6">
            <span class="fw-bold">หมายเลขโทรศัพท์มือถือ : </span>
            <span class="fst-italic">{{ complainant_item.phone_number }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12" v-if="complaint_item.is_anonymous == 1">
            <div class="row">
              <div class="col-md-6">
                <span class="fw-bold">ประเภทบัตร : </span>
                <span class="fst-italic">{{
                  selectOptions.card_types[complainant_item.card_type.value - 1]
                    .name
                }}</span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-6">
                <span class="fw-bold">หมายเลขบัตรประชาชน/Passport : </span>
                <span class="fst-italic">{{ complainant_item.id_card }}</span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-6">
                <span class="fw-bold">ชื่อ-นามสกุล : </span>
                <span class="fst-italic"
                  >{{ complainant_item.prefix_name_id?.name_th
                  }}{{ complainant_item.firstname }}
                  {{ complainant_item.lastname }}</span
                >
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-6">
                <span class="fw-bold">วัน/เดือน/ปีเกิด : </span>
                <span class="fst-italic">
                  {{ new_item.birthday }}
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-12">
                <span class="fw-bold">อาชีพ : </span>
                <span class="fst-italic">
                  {{ complainant_item.occupation_text }}
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-12">
                <span class="fw-bold">ที่อยู่ : </span>
                <span class="fst-italic">
                  {{
                    complainant_item.house_number
                      ? "บ้านเลขที่ " + complainant_item.house_number
                      : ""
                  }}{{
                    complainant_item.building
                      ? " หมู่บ้าน " + complainant_item.building
                      : ""
                  }}{{
                    complainant_item.moo
                      ? " หมู่ที่ " + complainant_item.moo
                      : ""
                  }}{{
                    complainant_item.soi
                      ? " ตรอก/ซอย " + complainant_item.soi
                      : ""
                  }}{{
                    complainant_item.road ? " ถนน " + complainant_item.road : ""
                  }}
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-12">
                <span class="fw-bold">ตำบล/อำเภอ/จังหวัด : </span>
                <span class="fst-italic">
                  {{
                    complainant_item.address_all?.sub_district_th +
                    " > " +
                    complainant_item.address_all?.district_th +
                    " > " +
                    complainant_item.address_all?.province_th +
                    " > " +
                    complainant_item.address_all?.post_code
                  }}
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-6">
                <span class="fw-bold">อีเมล : </span>
                <span class="fst-italic">
                  {{ complainant_item.email }}
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-6">
                <span class="fw-bold">Line ID : </span>
                <span class="fst-italic">
                  {{ complainant_item.line_id }}
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
              <div class="col-md-12">
                <span class="fw-bold">รูปถ่ายตนเองพร้อมบัตร : </span>
                <br />
                <span class="fst-italic">
                  <img
                    :src="previewCardPhoto"
                    class="mt-5 w-100 w-md-50"
                    v-if="previewCardPhoto"
                  />
                  <img
                    :src="
                      previewCardPhoto == null &&
                      complainant_item.card_photo_old != null
                        ? complainant_item.card_photo_old
                        : null
                    "
                    alt=""
                    class="mt-5 w-100 w-md-50"
                  />
                </span>
                <div class="separator separator-dotted my-2"></div>
              </div>
            </div>
          </div>

          <div class="col-md-12 mb-5 mt-5">
            <h4>3.2 ข้อมูลเรื่อง{{ complaint_type.name_th }}</h4>
          </div>

          <div class="col-md-12">
            <span class="fw-bold"
              >หัวข้อเรื่อง{{ complaint_type.name_th }} :
            </span>
            <span class="fst-italic">{{ complaint_item.complaint_title }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12">
            <span class="fw-bold">ประเภท/ลักษณะเรื่อง : </span>
            <span class="fst-italic">{{
              complaint_item.complaint_topic?.topic_category_th +
              " > " +
              complaint_item.complaint_topic?.topic_type_th
            }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12">
            <span class="fw-bold">สถานที่เกิดเหตุ : </span>
            <span class="fst-italic">
              {{
                complaint_item.address_all?.sub_district_th +
                " > " +
                complaint_item.address_all?.district_th +
                " > " +
                complaint_item.address_all?.province_th +
                " > " +
                complaint_item.address_all?.post_code
              }}</span
            >
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12">
            <span class="fw-bold">ข้อมูลสถานที่เกิดเหตุ : </span>
            <span class="fst-italic">{{
              complaint_item.incident_location
            }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12">
            <span class="fw-bold">วันที่เกิดเหตุ : </span>
            <span class="fst-italic">
              {{ new_item.incident_date }}
              {{ new_item.incident_time }}
              {{ new_item.day_time }}</span
            >
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12">
            <span class="fw-bold">Google Map : </span>
            <br />
            <GMapMap
              v-if="
                complaint_item.location_coordinates != null &&
                complaint_item.location_coordinates != ''
              "
              :center="new_item.markerDetails.position"
              :click="false"
              :zoom="14"
              map-type-id="terrain"
              style="width: 100%; height: 400px"
            >
              <GMapMarker
                :key="1"
                :position="new_item.markerDetails.position"
                :clickable="false"
                :draggable="false"
              >
              </GMapMarker>
            </GMapMap>
            <!-- <span class="fst-italic"> </span> -->
            <div class="separator separator-dotted my-2"></div>
          </div>

          <div v-for="(ac, idx) in accused" :key="idx" class="row">
            <div class="col-md-12">
              <span class="fw-bold">ผู้ถูกร้องคนที่ {{ idx + 1 }} : </span>
              <span class="fst-italic">
                {{
                  ac.prefix_name_id
                    ? ac.prefix_name_id?.name_th +
                      "" +
                      ac.firstname +
                      " " +
                      ac.lastname
                    : ""
                }}
              </span>
              <div class="separator separator-dotted my-2"></div>
            </div>
            <div class="col-md-12">
              <span class="fw-bold">หน่วยงานผู้ถูกร้อง : </span>
              <span class="fst-italic">{{ ac.organization_all?.label }}</span>
              <div class="separator separator-dotted my-2"></div>
            </div>
            <div class="col-md-6">
              <span class="fw-bold">สายงาน : </span>
              <span class="fst-italic">{{ ac.section_id?.name_th }}</span>
              <div class="separator separator-dotted my-2"></div>
            </div>
            <div class="col-md-6">
              <span class="fw-bold">ตำแหน่งงาน : </span>
              <span class="fst-italic">{{ ac.position_id?.name_th }}</span>
              <div class="separator separator-dotted my-2"></div>
            </div>
          </div>

          <div class="col-md-12">
            <span class="fw-bold">พฤติกรรมการกระทำความผิด : </span>
            <span class="fst-italic">{{
              complaint_item.complaint_detail
            }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>

          <div v-for="(cf, idx) in complaint_file_attach" :key="idx">
            <span class="fw-bold">ไฟล์หลักฐานเพิ่มเติม {{ idx + 1 }} : </span>
            <a :href="cf.filename" target="_blank"
              ><span class="fst-italic">คลิก</span></a
            >
            <div class="separator separator-dotted my-2"></div>
          </div>

          <div class="col-md-12">
            <span class="fw-bold">ลิ้งค์เพิ่มเติม : </span>
            <span
              class="fst-italic"
              v-for="(eu, idx) in new_item.evidence_url"
              :key="idx"
              >{{ idx != 0 ? " , " : "" }}
              <a :href="eu" target="_blank">{{ eu }}</a>
            </span>
            <div class="separator separator-dotted my-2"></div>
          </div>

          <div class="col-md-12">
            <span class="fw-bold"
              >เคยร้องเรียน/ร้องทุกข์ขอความช่วยเหลือ/แจ้งเบาะแสเรื่องนี้ผ่านช่องทางใด
              :
            </span>
            <span class="fst-italic">{{ new_item.complaint_channel_all }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>
          <div class="col-md-12">
            <span class="fw-bold">เคยร้องเรียนผ่านช่องทางร้องเรียนอื่น : </span>
            <span class="fst-italic">{{
              complaint_item.channel_history_text
            }}</span>
            <div class="separator separator-dotted my-2"></div>
          </div>

          <div class="col-md-12 mt-5 mb-5">
            <div
              class="d-flex justify-content-center align-items-center"
              @click="onPolicyModal"
            >
              <input
                class="form-check-input form-control form-check-input-custom"
                type="checkbox"
                :checked="policy_checkbox_tab"
                name="flexCheckDefault"
                disabled
              />
              <label
                class="form-check-label ms-3 text-primary fw-bold fs-3"
                for="checkboxCentered"
                >ยอมรับ นโนบายข้อมูลส่วนบุคคลและ พรบ. คุ้มครองข้อมูล</label
              >
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="modal fade" tabindex="1" ref="policyModalRef" id="policy-modal">
      <div class="modal-dialog modal-dialog-centered modal-lg">
        <div class="modal-content">
          <div class="modal-header text-center">
            <h3>นโยบายการคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)</h3>
          </div>

          <div class="modal-body mx-auto pb-10 pt-10">
            <h3 class="mb-7">สำนักงานจเรตำรวจแห่งชาติ</h3>
            <div id="paragraph-1" class="fs-5">
              <h4>๑. บทนำ</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติตระหนักถึงความสำคัญของข้อมูลส่วนบุคคลและข้อมูลอื่นอันเกี่ยวกับท่าน
                (รวมเรียกว่า “ข้อมูล”) เพื่อให้ท่านสามารถเชื่อมั่นได้ว่า
                สำนักงานจเรตำรวจแห่งชาติ
                มีความโปร่งใสและความรับผิดชอบในการเก็บรวบรวม
                ใช้หรือเปิดเผยข้อมูลของท่านตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                พ.ศ. ๒๕๖๒ (“กฎหมายคุ้มครองข้อมูลส่วนบุคคล”)
                รวมถึงกฎหมายอื่นที่เกี่ยวข้อง นโยบายการคุ้มครองข้อมูลส่วนบุคคล
                (“นโยบาย”)
                นี้จึงได้ถูกจัดทำขึ้นเพื่อชี้แจงแก่ท่านถึงรายละเอียดเกี่ยวกับการเก็บรวบรวม
                ใช้หรือเปิดเผย (รวมเรียกว่า “ประมวลผล”)
                ข้อมูลส่วนบุคคลซึ่งดำเนินการโดย สำนักงานจเรตำรวจแห่งชาติ
                รวมถึงเจ้าหน้าที่และบุคคลที่เกี่ยวข้องผู้ดำเนินการแทนหรือในนามของ
                สำนักงานจเรตำรวจแห่งชาติ โดยมีเนื้อหาสาระดังต่อไปนี้
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๒. ขอบเขตการบังคับใช้นโยบาย</h4>
              <p class="ti-2 text-justify">
                นโยบายนี้ใช้บังคับกับข้อมูลส่วนบุคคลของบุคคลซึ่งมีความสัมพันธ์กับสำนักงานจเรตำรวจแห่งชาติ
                ในปัจจุบันและที่อาจมีในอนาคต
                ซึ่งถูกประมวลผลข้อมูลส่วนบุคคลโดยสำนักงานจเรตำรวจแห่งชาติ
                รวมถึงคู่สัญญา
                หรือบุคคลภายนอกที่ประมวลผลข้อมูลส่วนบุคคลแทนหรือในนามของ
                สำนักงานจเรตำรวจแห่งชาติ (“ผู้ประมวลผลข้อมูลส่วนบุคคล”)
                ภายใต้บริการต่าง ๆ เช่น เว็บไซต์ ระบบ แอปพลิเคชัน เอกสาร หรือ
                บริการในรูปแบบอื่นที่ควบคุมดูแลโดย สำนักงานจเรตำรวจแห่งชาติ
                (รวมเรียกว่า “บริการ”)
              </p>
              <p class="ti-2 text-justify">
                นอกจากนโยบายฉบับนี้แล้ว สำนักงานจเรตำรวจแห่งชาติ
                อาจกำหนดให้มีคำประกาศเกี่ยวกับความเป็นส่วนตัว (“ประกาศ”)
                สำหรับบริการของสำนักงานจเรตำรวจแห่งชาติ
                เพื่อชี้แจงให้เจ้าของข้อมูลส่วนบุคคลซึ่งเป็นผู้ใช้บริการได้ทราบถึงข้อมูลส่วนบุคคลที่ถูกประมวลผล
                วัตถุประสงค์และเหตุผลอันชอบด้วยกฎหมายในการประมวลผล
                ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล
                รวมถึงสิทธิในข้อมูลส่วนบุคคลที่เจ้าของข้อมูลส่วนบุคคลพึง
                มีในบริการนั้นเป็นการเฉพาะเจาะจง
              </p>
              <p class="ti-2 text-justify">
                ทั้งนี้
                ในกรณีที่มีความขัดแย้งกันในสาระสำคัญระหว่างความในประกาศเกี่ยวกับความเป็นส่วนตัวและนโยบายนี้
                ให้ถือตามความในประกาศเกี่ยวกับความเป็นส่วนตัวของบริการนั้น
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๓. คำนิยาม</h4>
              <p class="ti-2 text-justify">
                - ข้อมูลส่วนบุคคล หมายถึง ข้อมูลเกี่ยวกับบุคคลธรรมดา
                ซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
                แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
              </p>
              <p class="ti-2 text-justify">
                - ข้อมูลส่วนบุคคลอ่อนไหว หมายถึง
                ข้อมูลส่วนบุคคลตามที่ถูกบัญญัติไว้ในมาตรา
                26แห่งพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ซึ่งได้แก่
                ข้อมูลเชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง
                ความเชื่อในลัทธิ ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม
                ข้อมูลสุขภาพ ความพิการ ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม
                ข้อมูลชีวภาพ
                หรือข้อมูลอื่นใดซึ่งกระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด
              </p>
              <p class="ti-2 text-justify">
                - การประมวลผลข้อมูลส่วนบุคคล หมายถึง การดำเนินการใด ๆ
                กับข้อมูลส่วนบุคคล เช่น เก็บรวบรวม บันทึก สำเนา จัดระเบียบ
                เก็บรักษา ปรับปรุง เปลี่ยนแปลง ใช้ กู้คืน เปิดเผย ส่งต่อ เผยแพร่
                โอน รวม ลบ ทำลาย เป็นต้น
              </p>
              <p class="ti-2 text-justify">
                - เจ้าของข้อมูลส่วนบุคคล หมายถึง
                บุคคลธรรมดาซึ่งเป็นเจ้าของข้อมูลส่วนบุคคลที่ สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวม ใช้ หรือเปิดเผย
              </p>
              <p class="ti-2 text-justify">
                - ผู้ควบคุมข้อมูลส่วนบุคคล หมายถึง
                บุคคลหรือนิติบุคคลซึ่งมีอำนาจหน้าที่ตัดสินใจเกี่ยวกับการเก็บรวบรวม
                ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
              </p>
              <p class="ti-2 text-justify">
                - ผู้ประมวลผลข้อมูลส่วนบุคคล หมายถึง
                บุคคลหรือนิติบุคคลซึ่งดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลตามคำสั่งหรือในนามของผู้ควบคุมข้อมูลส่วนบุคคล
                ทั้งนี้
                บุคคลหรือนิติบุคคลซึ่งดำเนินการดังกล่าวไม่เป็นผู้ควบคุมข้อมูลส่วนบุคคล
              </p>
            </div>

            <!--  -->
            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>
                ๔. แหล่งที่มาของข้อมูลส่วนบุคคลที่ สำนักงานจเรตำรวจแห่งชาติ เก็บรวบรวม
              </h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ เก็บรวบรวมหรือได้มาซึ่งข้อมูลส่วนบุคคลประเภทต่าง ๆ
                จากแหล่งข้อมูลดังต่อไปนี้
              </p>
              <p class="ti-2 text-justify">
                ๑. ข้อมูลส่วนบุคคลที่ สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวมจากเจ้าของข้อมูลส่วนบุคคลโดยตรงในช่องทางให้บริการต่าง
                ๆ เช่น ขั้นตอนการสมัคร ลงทะเบียน สมัครงาน ลงนามในสัญญา เอกสาร
                ทำแบบสำรวจ การยื่นคำขอ การพิจารณาอนุญาต หรือ บริการ
                หรือช่องทางให้บริการอื่นที่ควบคุมดูแลโดย สำนักงานจเรตำรวจแห่งชาติ
                หรือเมื่อเจ้าของข้อมูลส่วนบุคคลติดต่อสื่อสารกับ สำนักงานจเรตำรวจแห่งชาติ ณ
                ที่ทำการหรือผ่านช่องทางติดต่ออื่นที่ควบคุมดูแลโดย สำนักงานจเรตำรวจแห่งชาติ
                เป็นต้น
              </p>
              <p class="ti-2 text-justify">
                ๒. ข้อมูลที่ สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวมจากการที่เจ้าของข้อมูลส่วนบุคคลเข้าใช้งานเว็บไซต์
                หรือบริการอื่น ๆ
                ตามสัญญาหรือตามพันธกิจในความรับผิดชอบของสำนักงานจเรตำรวจแห่งชาติ เช่น
                การติดตามพฤติกรรมการใช้งานเว็บไซต์ ผลิตภัณฑ์หรือบริการของ
                สำนักงานจเรตำรวจแห่งชาติ ด้วยการใช้คุกกี้ (Cookies)
                หรือจากซอฟต์แวร์บนอุปกรณ์ของเจ้าของข้อมูลส่วนบุคคล เป็นต้น
              </p>
              <p class="ti-2 text-justify">
                ๓. ข้อมูลส่วนบุคคลที่ สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวมจากแหล่งอื่นนอกจากเจ้าของข้อมูลส่วนบุคคล
                โดยที่แหล่งข้อมูลดังกล่าวมีอำนาจหน้าที่
                มีเหตุผลที่ชอบด้วยกฎหมายหรือได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลแล้วในการเปิดเผยข้อมูลแก่
                สำนักงานจเรตำรวจแห่งชาติ เช่น
                การเชื่อมโยงบริการดิจิทัลของหน่วยงานของรัฐในการให้บริการเพื่อประโยชน์สาธารณะแบบเบ็ดเสร็จแก่เจ้าของข้อมูลส่วนบุคคลเอง
                การรับข้อมูลส่วนบุคคลจากหน่วยงานของรัฐแห่งอื่นในฐานะที่
                สำนักงานจเรตำรวจแห่งชาติ
                มีหน้าที่ตามพันธกิจในการดำเนินการจัดให้มีศูนย์แลกเปลี่ยนข้อมูลกลางเพื่อสนับสนุนการดำเนินการของหน่วยงานของรัฐในการให้บริการประชาชนผ่านระบบดิจิทัล
                รวมถึงจากความจำเป็นเพื่อให้บริการตามสัญญาที่อาจมีการแลกเปลี่ยนข้อมูลส่วนบุคคลกับหน่วยงานคู่สัญญาได้
              </p>
              <p class="ti-2 text-justify">
                นอกจากนี้
                ยังหมายความรวมถึงกรณีที่ท่านเป็นผู้ให้ข้อมูลส่วนบุคคลของบุคคลภายนอกแก่
                สำนักงานจเรตำรวจแห่งชาติ ดังนี้
                ท่านมีหน้าที่รับผิดชอบในการแจ้งรายละเอียดตามนโยบายนี้หรือประกาศของผลิตภัณฑ์หรือบริการ
                ตามแต่กรณี ให้บุคคลดังกล่าวทราบ
                ตลอดจนขอความยินยอมจากบุคคลนั้นหากเป็นกรณีที่ต้องได้รับความยินยอมในการเปิดเผยข้อมูลแก่
                สำนักงานจเรตำรวจแห่งชาติ
              </p>
              <p class="ti-2 text-justify">
                ทั้งนี้
                ในกรณีที่เจ้าของข้อมูลส่วนบุคคลปฏิเสธไม่ให้ข้อมูลที่มีความจำเป็นในการให้บริการ
                ของ สำนักงานจเรตำรวจแห่งชาติ อาจเป็นผลให้ สำนักงานจเรตำรวจแห่งชาติ
                ไม่สามารถให้บริการนั้นแก่เจ้าของข้อมูลส่วนบุคคลดังกล่าวได้ทั้งหมดหรือบางส่วน
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๕. ฐานกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคล</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวมข้อมูลส่วนบุคคลของท่านตามความเหมาะสมและตามบริบท
                ของการให้บริการ ทั้งนี้ ตามอำนาจหน้าที่ตามที่กฎหมายให้อำนาจไว้
                เช่น
              </p>
              <p class="ti-2 text-justify">
                ฐานทางกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคลที่สำนักงานจเรตำรวจแห่งชาติใช้
                ประกอบด้วย
              </p>
              <p class="ti-2 text-justify">
                ๕.๑
                เพื่อการดำเนินภารกิจเพื่อประโยชน์สาธารณะหรือการใช้อำนาจรัฐของสำนักงานจเรตำรวจแห่งชาติ
              </p>
              <p class="ti-2 text-justify">
                ๕.๒ เพื่อการปฏิบัติหน้าที่ตามกฎหมาย
              </p>
              <p class="ti-2 text-justify">
                ๕.๓ เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย
              </p>
              <p class="ti-2 text-justify">
                ๕.๔ เป็นการจำเป็นเพื่อการป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย
                หรือสุขภาพของบุคคล
              </p>
              <p class="ti-2 text-justify">๕.๕ เพื่อการปฏิบัติตามสัญญา</p>
              <p class="ti-2 text-justify">
                ๕.๖ เพื่อการจัดทำเอกสารประวัติศาสตร์ วิจัยหรือสถิติที่สำคัญ
              </p>

              <p class="ti-2 text-justify">๕.๗ ความยินยอมของท่าน</p>

              <p class="ti-2 text-justify">
                ในกรณีที่สำนักงานจเรตำรวจแห่งชาติมีความจำเป็นต้องเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อการปฏิบัติ
                ตามสัญญา การปฏิบัติหน้าที่ตามกฎหมาย
                หรือเพื่อความจำเป็นในการเข้าทำสัญญา หากท่านปฏิเสธ
                ไม่ให้ข้อมูลส่วนบุคคลหรือ
                คัดค้านการดำเนินการประมวลผลตามวัตถุประสงค์ของกิจกรรม
                อาจมีผลทำให้สำนักงานจเรตำรวจแห่งชาติไม่สามารถดำเนินการหรือให้บริการตามที่ท่านร้องขอได้ทั้งหมดหรือบางส่วน
              </p>
            </div>
            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๖. ประเภทของข้อมูลส่วนบุคคลที่สำนักงานจเรตำรวจแห่งชาติเก็บรวบรวม</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติอาจเก็บรวบรวมหรือได้มาซึ่งข้อมูลดังต่อไปนี้
                ซึ่งอาจรวมถึงข้อมูลส่วนบุคคล ของท่าน ทั้งนี้
                ขึ้นอยู่กับงานบริการที่ท่านขอรับบริการหรือบริบทความสัมพันธ์ที่ท่านมีกับสำนักงานจเรตำรวจแห่งชาติ
                รวมถึงข้อพิจารณาอื่นที่มีผลกับการเก็บรวบรวมข้อมูลส่วนบุคคล
                โดยประเภทของข้อมูลที่ระบุไว้ดังต่อไปนี้เป็นเพียงกรอบการเก็บรวบรวมข้อมูลส่วนบุคคลของสำนักงานจเรตำรวจแห่งชาติเป็นการทั่วไป
                ทั้งนี้
                เฉพาะข้อมูลที่เกี่ยวข้องกับบริการที่ท่านใช้งานหรือมีความสัมพันธ์ด้วยเท่านั้นที่จะมีผลบังคับใช้
              </p>

              <p class="ti-2 text-justify">
                ๖.๑ ข้อมูลส่วนบุคคล ได้แก่
                ข้อมูลระบุชื่อเรียกของท่านหรือข้อมูลจากเอกสารราชการที่ระบุข้อมูลเฉพาะตัวของท่าน
                เช่น คำนำหน้าชื่อ ชื่อ นามสกุล ชื่อกลาง ชื่อเล่น ลายมือชื่อ
                เลขที่บัตรประจำตัวประชาชน สัญชาติ เลขที่ใบขับขี่
                เลขที่หนังสือเดินทาง ข้อมูลทะเบียนบ้าน หมายเลขใบประกอบการ
                หมายเลขใบอนุญาตการประกอบวิชาชีพ (สำหรับแต่ละอาชีพ)
                หมายเลขประจำตัวผู้ประกันตน หมายเลขประกันสังคม เป็นต้น
              </p>

              <p class="ti-2 text-justify">
                ๖.๒ ข้อมูลส่วนบุคคลที่มีความละเอียดอ่อน ได้แก่
                ข้อมูลส่วนบุคคลที่มีความละเอียดอ่อนของท่าน เช่น เชื้อชาติ
                ข้อมูลศาสนา ข้อมูลความพิการ ข้อมูลความเห็นทางการเมือง
                ประวัติอาชญากรรม ข้อมูลชีวภาพ (ข้อมูลภาพจำลองใบหน้า)
                ข้อมูลพันธุกรรม ข้อมูลเกี่ยวกับสุขภาพ เป็นต้น
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๗. คุกกี้</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวมและใช้คุกกี้รวมถึงเทคโนโลยีอื่นในลักษณะเดียวกันในเว็บไซต์ที่อยู่ภายใต้ความดูแลของสำนักงานจเรตำรวจแห่งชาติหรือบนอุปกรณ์ของท่านตามแต่บริการที่ท่านใช้งาน
                ทั้งนี้ เพื่อการดำเนินการด้านความปลอดภัยในการให้บริการของ
                สำนักงานจเรตำรวจแห่งชาติ
                และเพื่อให้ท่านซึ่งเป็นผู้ใช้งานได้รับความสะดวกและประสบการณ์ที่ดีในการใช้งานบริการของ
                สำนักงานจเรตำรวจแห่งชาติ และข้อมูลเหล่านี้จะถูกนำไปเพื่อปรับปรุงเว็บไซต์ของ
                สำนักงานจเรตำรวจแห่งชาติ ให้ตรงกับความต้องการของท่านมากยิ่งขึ้น
                โดยท่านสามารถตั้งค่าหรือลบการใช้งานคุกกี้ได้ด้วยตนเองจากการตั้งค่าในเว็บเบราว์เซอร์
                (Web Browser) ของท่าน
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>
                ๘. ข้อมูลส่วนบุคคลของผู้เยาว์
                คนไร้ความสามารถและคนเสมือนไร้ความสามารถ
              </h4>
              <p class="ti-2 text-justify">
                กรณีที่ สำนักงานจเรตำรวจแห่งชาติ
                ทราบว่าข้อมูลส่วนบุคคลที่จำเป็นต้องได้รับความยินยอมในการเก็บรวบรวม
                เป็นของเจ้าของข้อมูลส่วนบุคคลซึ่งเป็นผู้เยาว์
                คนไร้ความสามารถหรือคนเสมือนไร้ความสามารถต่อเมื่อ
                ได้รับความยินยอมจากผู้ใช้อำนาจปกครองที่มีอำนาจกระทำการแทนผู้เยาว์
                หรือผู้อนุบาล หรือผู้พิทักษ์ ตามแต่กรณี
                ยกเว้นเป็นกรณีที่สำนักงานจเรตำรวจแห่งชาติมีอำนาจดำเนินการได้ตามที่กฎหมายกำหนด
              </p>
              <p class="ti-2 text-justify">
                กรณีที่ สำนักงานจเรตำรวจแห่งชาติ
                ไม่ทราบมาก่อนว่าเจ้าของข้อมูลส่วนบุคคลเป็นผู้เยาว์
                คนไร้ความสามารถหรือคนเสมือนไร้ความสามารถ และมาพบในภายหลังว่า
                สำนักงานจเรตำรวจแห่งชาติ
                ได้เก็บรวบรวมข้อมูลของเจ้าของข้อมูลส่วนบุคคลดังกล่าวโดยยังมิได้รับความยินยอมจากผู้ใช้อำนาจปกครองที่มีอำนาจกระทำการแทนผู้เยาว์
                หรือผู้อนุบาล หรือผู้พิทักษ์ตามแต่กรณี ดังนี้ สำนักงานจเรตำรวจแห่งชาติ
                จะดำเนินการลบทำลายข้อมูลส่วนบุคคลนั้น
                เว้นแต่มีกฎหมายให้อำนาจดำเนินการในเรื่องนั้นไว้
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๙. วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ
                ดำเนินการเก็บรวบรวมข้อมูลเพื่อให้บรรลุวัตถุประสงค์ในการปฏิบัติตามภารกิจ
                ในอำนาจหน้าที่ของสำนักงานจเรตำรวจแห่งชาติ
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๐. การส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ</h4>
              <p class="ti-2 text-justify">
                ในบางกรณี สำนักงานจเรตำรวจแห่งชาติ
                อาจจำเป็นต้องส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังต่างประเทศเพื่อดำเนินการตามวัตถุประสงค์ในการให้บริการแก่ท่าน
                เช่น เพื่อส่งข้อมูลส่วนบุคคลไปยังระบบคลาวด์ (Cloud)
                ที่มีแพลตฟอร์มหรือเครื่องแม่ข่าย (Server) อยู่ต่างประเทศ (เช่น
                ประเทศสิงคโปร์ หรือสหรัฐอเมริกา เป็นต้น)
                เพื่อสนับสนุนระบบเทคโนโลยีสารสนเทศที่ตั้งอยู่นอกประเทศไทย
                ทั้งนี้ ขึ้นอยู่กับบริการของ สำนักงานจเรตำรวจแห่งชาติ
                ที่ท่านใช้งานหรือมีส่วนเกี่ยวข้องเป็นรายกิจกรรม
              </p>

              <p class="ti-2 text-justify">
                อย่างไรก็ตาม ในขณะที่จัดทำนโยบายฉบับนี้
                คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลยังมิได้
                มีประกาศกำหนดรายการประเทศปลายทางที่มีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่เพียงพอ
                ดังนั้น เมื่อ สำนักงานจเรตำรวจแห่งชาติ
                มีความจำเป็นต้องส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังประเทศปลายทาง
                สำนักงานจเรตำรวจแห่งชาติ
                จะดำเนินการเพื่อให้ข้อมูลส่วนบุคคลที่ส่งหรือโอนไปมีมาตรการคุ้มครองข้อมูลส่วนบุคคลอย่างเพียงพอตามมาตรฐานสากล
                หรือดำเนินการตามเงื่อนไขเพื่อให้สามารถส่งหรือโอนข้อมูลนั้นได้
                ตามกฎหมาย ได้แก่
              </p>

              <p class="ti-2 text-justify">
                -
                เป็นการปฏิบัติตามกฎหมายที่กำหนดให้สำนักงานจเรตำรวจแห่งชาติต้องส่งหรือโอนข้อมูลส่วนบุคคลไปต่างประเทศ
              </p>
              <p class="ti-2 text-justify">
                -
                ได้แจ้งให้ท่านทราบและได้รับความยินยอมจากท่านในกรณีที่ประเทศปลายทางมีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่ไม่เพียงพอ
                ทั้งนี้ตามประกาศรายชื่อประเทศที่คณะกรรมการคุ้มครองส่วนบุคคลประกาศกำหนด
              </p>
              <p class="ti-2 text-justify">
                - เป็นการจำเป็นเพื่อปฏิบัติตามสัญญาที่ท่านเป็นคู่สัญญากับ
                สำนักงานจเรตำรวจแห่งชาติ หรือเป็นการทำตามคำขอของท่านก่อนการเข้าทำสัญญานั้น
              </p>
              <p class="ti-2 text-justify">
                - เป็นการกระทำตามสัญญาของ สำนักงานจเรตำรวจแห่งชาติ กับบุคคลหรือนิติบุคคลอื่น
                เพื่อประโยชน์ของท่าน
              </p>
              <p class="ti-2 text-justify">
                - เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย
                หรือสุขภาพของท่านหรือของบุคคลอื่น
                เมื่อท่านไม่สามารถให้ความยินยอมในขณะนั้นได้
              </p>
              <p class="ti-2 text-justify">
                - เป็นการจำเป็นเพื่อดำเนินภารกิจเพื่อประโยชน์สาธารณะที่สำคัญ
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๑. ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ
                จะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้ในระยะเวลาเท่าที่ข้อมูลนั้นยังมีความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลเท่านั้น
                ตามรายละเอียดที่ได้กำหนดไว้ในนโยบาย
                ประกาศหรือตามกฎหมายที่เกี่ยวข้อง ทั้งนี้
                เมื่อพ้นระยะเวลาและข้อมูลส่วนบุคคลของท่านสิ้นความจำเป็นตามวัตถุประสงค์ดังกล่าวแล้ว
                สำนักงานจเรตำรวจแห่งชาติ จะทำการลบ ทำลายข้อมูลส่วนบุคคลของท่าน
                หรือทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวตนได้ต่อไป
                ตามรูปแบบและมาตรฐานการลบทำลายข้อมูลส่วนบุคคลที่คณะกรรมการหรือกฎหมายประกาศกำหนดหรือตามมาตรฐานสากล
              </p>
              <p class="ti-2 text-justify">
                อย่างไรก็ดี ในกรณีที่มีข้อพิพาท
                การใช้สิทธิหรือคดีความอันเกี่ยวข้องกับข้อมูลส่วนบุคคลของท่าน
                สำนักงานจเรตำรวจแห่งชาติ
                ขอสงวนสิทธิในการเก็บรักษาข้อมูลนั้นต่อไปจนกว่าข้อพิพาทนั้นจะได้มีคำสั่งหรือคำพิพากษาถึงที่สุด
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๒. การให้บริการโดยบุคคลที่สามหรือผู้ให้บริการช่วง</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ อาจมีการมอบหมายหรือจัดซื้อจัดจ้างบุคคลที่สาม
                (ผู้ประมวลผลข้อมูลส่วนบุคคล)
                ให้ทำการประมวลผลข้อมูลส่วนบุคคลแทนหรือในนามของสำนักงานจเรตำรวจแห่งชาติซึ่งบุคคลที่สามดังกล่าวอาจเสนอบริการในลักษณะต่าง
                ๆ เช่น การเป็นผู้ดูแล (Hosting) รับงานบริการช่วง (Outsourcing)
                หรือเป็นผู้ให้บริการคลาวด์ (Cloud computing service/provider)
                หรือเป็นงานในลักษณะการจ้างทำของในรูปแบบอื่น
              </p>
              <p class="ti-2 text-justify">
                การมอบหมายให้บุคคลที่สามทำการประมวลผลข้อมูลส่วนบุคคลในฐานะผู้ประมวลผลข้อมูลส่วนบุคคลนั้น
                สำนักงานจเรตำรวจแห่งชาติ จะจัดให้มีข้อตกลงระบุสิทธิและหน้าที่ของ
                สำนักงานจเรตำรวจแห่งชาติ ในฐานะผู้ควบคุมข้อมูลส่วนบุคคลและของบุคคลที่
                สำนักงานจเรตำรวจแห่งชาติ มอบหมายในฐานะผู้ประมวลผลข้อมูลส่วนบุคคล
                ซึ่งรวมถึงกำหนดรายละเอียดประเภทข้อมูลส่วนบุคคลที่ สำนักงานจเรตำรวจแห่งชาติ
                มอบหมายให้ประมวลผล รวมถึงวัตถุประสงค์
                ขอบเขตในการประมวลผลข้อมูลส่วนบุคคลและข้อตกลงอื่น ๆ ที่เกี่ยวข้อง
                ซึ่งผู้ประมวลผลข้อมูลส่วนบุคคลมีหน้าที่ประมวลผลข้อมูลส่วนบุคคลตามขอบเขตที่ระบุในข้อตกลงและตามคำสั่งของ
                สำนักงานจเรตำรวจแห่งชาติ
                เท่านั้นโดยไม่สามารถประมวลผลเพื่อวัตถุประสงค์อื่นได้
              </p>
              <p class="ti-2 text-justify">
                ในกรณีที่ผู้ประมวลผลข้อมูลส่วนบุคคลมีการมอบหมายผู้ให้บริการช่วง
                (ผู้ประมวลผลช่วง)
                เพื่อทำการประมวลผลข้อมูลส่วนบุคคลแทนหรือในนามของผู้ประมวลผลข้อมูลส่วนบุคคล
                ดังนี้ สำนักงานจเรตำรวจแห่งชาติ
                จะกำกับให้ผู้ประมวลผลข้อมูลส่วนบุคคลจัดให้มีเอกสารข้อตกลงระหว่างผู้ประมวลผลข้อมูลส่วนบุคคลกับผู้ประมวลผลช่วง
                ในรูปแบบและมาตรฐานที่ไม่ต่ำกว่าข้อตกลงระหว่าง สำนักงานจเรตำรวจแห่งชาติ
                กับผู้ประมวลผลข้อมูลส่วนบุคคล
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๓. การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ มีมาตรการปกป้องข้อมูลส่วนบุคคล
                โดยการจำกัดสิทธิ์การเข้าถึงข้อมูลส่วนบุคคลให้สามารถเข้าถึงได้โดยเจ้าหน้าที่เฉพาะรายหรือบุคคลที่มีอำนาจหน้าที่หรือได้รับมอบหมายที่มี
                ความจำเป็นต้องใช้ข้อมูลดังกล่าวตามวัตถุประสงค์ที่ได้แจ้งเจ้าของข้อมูลส่วนบุคคลไว้แล้ว
                หรือตามที่ระเบียบกฎหมายกำหนดเท่านั้น
                ซึ่งบุคคลดังกล่าวจะต้องยึดมั่นและปฏิบัติตามมาตรการปกป้องข้อมูลส่วนบุคคล
                ของสำนักงานจเรตำรวจแห่งชาติ อย่างเคร่งครัด
                ตลอดจนมีหน้าที่รักษาความลับของข้อมูลส่วนบุคคลที่ตนเองรับรู้จากการปฏิบัติการตามอำนาจหน้าที่
              </p>
              <p class="ti-2 text-justify">
                นอกจากนี้ เมื่อ สำนักงานจเรตำรวจแห่งชาติ มีการส่ง
                โอนหรือเปิดเผยข้อมูลส่วนบุคคลแก่บุคคลที่สาม ไม่ว่า
                เพื่อการให้บริการตามพันธกิจ ตามสัญญา หรือข้อตกลงในรูปแบบอื่น
                สำนักงานจเรตำรวจแห่งชาติ
                จะกำหนดมาตรการรักษาความปลอดภัยข้อมูลส่วนบุคคลและการรักษาความลับที่เหมาะสมและเป็นไปตามที่กฎหมายกำหนด
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๔. การเชื่อมต่อเว็บไซต์หรือบริการภายนอก</h4>
              <p class="ti-2 text-justify">
                ๑๔.๑
                การเชื่อมโยงยังเว็บไซต์หรือบริการอื่นเป็นเพียงการให้บริการเพื่ออำนวยความสะดวกแก่ผู้ใช้บริการเท่านั้น
                สำนักงานจเรตำรวจแห่งชาติมิได้มีส่วนเกี่ยวข้องหรือมีอำนาจควบคุมรับรองความถูกต้อง
                ความน่าเชื่อถือตลอดจนความรับผิดชอบในเนื้อหาข้อมูลของเว็บไซต์หรือบริการนั้น
                ๆ และสำนักงานจเรตำรวจแห่งชาติไม่รับผิดชอบต่อเนื้อหาใด ๆ
                ที่แสดงบนเว็บไซต์หรือบริการอื่นที่เชื่อมโยงมายังเว็บไซต์หรือบริการ
                ของสำนักงานจเรตำรวจแห่งชาติหรือต่อความเสียหายใด ๆ
                ที่เกิดขึ้นจากการเข้าเยี่ยมชมเว็บไซต์หรือบริการดังกล่าว
              </p>
              <p class="ti-2 text-justify">
                ๑๔.๒ กรณีต้องการเชื่อมโยงมายังเว็บไซต์ของสำนักงานจเรตำรวจแห่งชาติ
                ผู้ใช้บริการสามารถเชื่อมโยงมายังหน้าแรกของเว็บไซต์สำนักงานจเรตำรวจแห่งชาติได้
                โดยแจ้งความประสงค์เป็นหนังสือ
                แต่หากต้องการเชื่อมโยงมายังหน้าภายในของเว็บไซต์นี้จะต้องได้รับความยินยอมเป็นหนังสือจากสำนักงานจเรตำรวจแห่งชาติเท่านั้น
                และในการให้ความยินยอมดังกล่าว
                กรมการปกรองขอสงวนสิทธิที่จะกำหนดเงื่อนไขใด ๆ ไว้ด้วยก็ได้
                ในการที่เว็บไซต์ที่เชื่อมโยงมายังเว็บไซต์ของสำนักงานจเรตำรวจแห่งชาติ
                สำนักงานจเรตำรวจแห่งชาติจะไม่รับผิดชอบต่อเนื้อหาใด ๆ
                ที่แสดงบนเว็บไซต์ที่เชื่อมโยงมายังเว็บไซต์ของสำนักงานจเรตำรวจแห่งชาติ
                หรือต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการใช้เว็บไซต์นั้น
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๕. เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ
                ได้แต่งตั้งเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลเพื่อทำหน้าที่ตรวจสอบ
                กำกับและให้คำแนะนำในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
                รวมถึงการประสานงานและให้ความร่วมมือกับสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
                เพื่อให้สอดคล้องตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
                ๒๕๖๒
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>
                ๑๖. สิทธิของท่านตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
                ๒๕๖๒
              </h4>
              <p class="ti-2 text-justify">
                พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. ๒๕๖๒
                ได้กำหนดสิทธิของเจ้าของข้อมูลส่วนบุคคลไว้หลายประการ ทั้งนี้
                สิทธิดังกล่าวจะเริ่มมีผลบังคับใช้เมื่อกฎหมายในส่วนของสิทธินี้มีผลใช้บังคับ
                โดยรายละเอียดของสิทธิต่าง ๆ ประกอบด้วย
              </p>
              <p class="ti-2 text-justify">
                - สิทธิในการขอเข้าถึงข้อมูลส่วนบุคคล ท่านมีสิทธิขอเข้าถึง
                รับสำเนาและขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลที่ สำนักงานจเรตำรวจแห่งชาติ
                เก็บรวบรวมไว้โดยปราศจากความยินยอมของท่าน เว้นแต่กรณีที่
                สำนักงานจเรตำรวจแห่งชาติ
                มีสิทธิปฏิเสธคำขอของท่านด้วยเหตุตามกฎหมายหรือคำสั่งศาล
                หรือกรณีที่การใช้สิทธิของท่านจะมีผลกระทบที่อาจก่อให้เกิดความเสียหายต่อสิทธิและเสรีภาพของบุคคลอื่น
              </p>
              <p class="ti-2 text-justify">
                - สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง
                สมบูรณ์และเป็นปัจจุบัน
                หากท่านพบว่าข้อมูลส่วนบุคคลของท่านไม่ถูกต้อง
                ไม่ครบถ้วนหรือไม่เป็นปัจจุบัน
                ท่านมีสิทธิขอให้แก้ไขเพื่อให้มีความถูกต้อง เป็นปัจจุบัน สมบูรณ์
                และไม่ก่อให้เกิดความเข้าใจผิดได้
              </p>

              <p class="ti-2 text-justify">
                - สิทธิในการลบหรือทำลายข้อมูลส่วนบุคคล ท่านมีสิทธิขอให้
                สำนักงานจเรตำรวจแห่งชาติ ลบหรือทำลายข้อมูลส่วนบุคคลของท่าน
                หรือทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลได้ต่อไป
                ทั้งนี้
                การใช้สิทธิลบหรือทำลายข้อมูลส่วนบุคคลนี้จะต้องอยู่ภายใต้เงื่อนไขตามที่กฎหมายกำหนด
              </p>
              <p class="ti-2 text-justify">
                - สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคล
                ท่านมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลของท่าน
              </p>
              <p class="ti-2 text-justify">
                - สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล
                ท่านมีสิทธิคัดค้านการเก็บรวบรวม
                ใช้หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับท่าน เว้นแต่กรณีที่
                สำนักงานจเรตำรวจแห่งชาติ มีเหตุในการปฏิเสธคำขอโดยชอบด้วยกฎหมาย (เช่น
                สำนักงานจเรตำรวจแห่งชาติ สามารถแสดงให้เห็นว่าการเก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลของท่านมีเหตุอันชอบด้วยกฎหมายยิ่งกว่า
                หรือเพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย
                การปฏิบัติตามหรือการใช้สิทธิเรียกร้องทางกฎหมาย
                หรือเพื่อประโยชน์สาธารณะของ สำนักงานจเรตำรวจแห่งชาติ)
              </p>
              <p class="ti-2 text-justify">
                - สิทธิในการขอถอนความยินยอม ในกรณีที่ท่านได้ให้ความยินยอมแก่
                สำนักงานจเรตำรวจแห่งชาติ ในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
                (ไม่ว่าความยินยอมนั้นจะได้ให้ไว้ก่อนหรือหลังพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                พ.ศ. ๒๕๖๒ มีผลใช้บังคับ)
                ท่านมีสิทธิถอนความยินยอมเมื่อใดก็ได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านถูกเก็บรักษาโดย
                สำนักงานจเรตำรวจแห่งชาติ เว้นแต่มีข้อจำกัดสิทธิโดยกฎหมายให้ สำนักงานจเรตำรวจแห่งชาติ
                จำเป็นต้องเก็บรักษาข้อมูลต่อไปหรือยังคงมีสัญญาระหว่างท่านกับ
                สำนักงานจเรตำรวจแห่งชาติ ที่ให้ประโยชน์แก่ท่านอยู่
              </p>

              <p class="ti-2 text-justify">
                - สิทธิในการขอรับ ส่งหรือโอนข้อมูลส่วนบุคคล
                ท่านมีสิทธิในการขอรับข้อมูลส่วนบุคคลของท่านจาก สำนักงานจเรตำรวจแห่งชาติ
                ในรูปแบบที่สามารถอ่านหรือใช้งานโดยทั่วไปได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้โดยวิธีการอัตโนมัติ
                รวมถึงอาจขอให้ สำนักงานจเรตำรวจแห่งชาติ
                ส่งหรือโอนข้อมูลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลรายอื่น
                ทั้งนี้ การใช้สิทธินี้จะต้องอยู่ภายใต้เงื่อนไขตามที่กฎหมายกำหนด
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>
                ๑๗. โทษของการไม่ปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคล
              </h4>
              <p class="ti-2 text-justify">
                การไม่ปฏิบัติตามนโยบายอาจมีผลเป็นความผิดและถูกลงโทษทางวินัยตามกฎเกณฑ์ของ
                สำนักงานจเรตำรวจแห่งชาติ (สำหรับเจ้าหน้าที่หรือผู้ปฏิบัติงานของ
                สำนักงานจเรตำรวจแห่งชาติ) หรือตามข้อตกลงการประมวลผลข้อมูลส่วนบุคคล
                (สำหรับผู้ประมวลผลข้อมูลส่วนบุคคล) ทั้งนี้
                ตามแต่กรณีและความสัมพันธ์ที่ท่านมีต่อ สำนักงานจเรตำรวจแห่งชาติ
                และอาจได้รับโทษตามที่กำหนดโดยพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                พ.ศ. ๒๕๖๒ รวมทั้งกฎหมายลำดับรอง กฎ ระเบียบ คำสั่งที่เกี่ยวข้อง
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๘. การร้องเรียนต่อหน่วยงานผู้มีอำนาจกำกับดูแล</h4>
              <p class="ti-2 text-justify">
                ในกรณีที่ท่านพบว่า สำนักงานจเรตำรวจแห่งชาติ
                มิได้ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
                ท่านมีสิทธิร้องเรียนไปยังคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
                หรือหน่วยงานที่มีอำนาจกำกับดูแลที่ได้รับการแต่งตั้งโดยคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลหรือตามกฎหมาย
                ทั้งนี้ ก่อนการร้องเรียนดังกล่าว สำนักงานจเรตำรวจแห่งชาติ
                ขอให้ท่านโปรดติดต่อมายัง สำนักงานจเรตำรวจแห่งชาติ เพื่อให้ สำนักงานจเรตำรวจแห่งชาติ
                มีโอกาสได้รับทราบข้อเท็จจริงและได้ชี้แจงในประเด็นต่าง ๆ
                รวมถึงจัดการแก้ไขข้อกังวลของท่านก่อนในโอกาสแรก
              </p>
            </div>

            <div id="paragraph-1 " class="fs-5 mt-6">
              <h4>๑๙. การปรับปรุงแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคล</h4>
              <p class="ti-2 text-justify">
                สำนักงานจเรตำรวจแห่งชาติ อาจพิจารณาปรับปรุง
                แก้ไขหรือเปลี่ยนแปลงนโยบายนี้ตามที่เห็นสมควร
                และจะทำการแจ้งให้ท่านทราบผ่านช่องทางเว็บไซต์ www.dopa.go.th
                โดยมีวันที่มีผลบังคับใช้ของแต่ละฉบับแก้ไขกำกับอยู่ อย่างไรก็ดี
                สำนักงานจเรตำรวจแห่งชาติ
                ขอแนะนำให้ท่านโปรดตรวจสอบเพื่อรับทราบนโยบายฉบับใหม่อย่างสม่ำเสมอ
                ผ่านแอปพลิเคชั่น หรือช่องทางเฉพาะกิจกรรมที่ สำนักงานจเรตำรวจแห่งชาติ
                ดำเนินการ โดยเฉพาะก่อนที่ท่านจะทำการเปิดเผยข้อมูลส่วนบุคคลแก่
                สำนักงานจเรตำรวจแห่งชาติ
              </p>
              <p class="ti-2 text-justify">
                การรับบริการของ สำนักงานจเรตำรวจแห่งชาติ ภายหลังการบังคับใช้นโยบายใหม่
                ถือเป็นการรับทราบตามข้อตกลงในนโยบายใหม่แล้ว ทั้งนี้
                โปรดหยุดการเข้าใช้งานหากท่านไม่เห็นด้วยกับรายละเอียดในนโยบายฉบับนี้และโปรดติดต่อมายัง
                สำนักงานจเรตำรวจแห่งชาติ เพื่อชี้แจงข้อเท็จจริงต่อไป
              </p>
            </div>

            <!--  -->
            <div class="mt-10 mb-5 text-center">
              <button class="btn btn-primary" @click="onAcceptPolicy(1)">
                ยอมรับ
              </button>
              <button class="btn btn-secondary ms-4" @click="onAcceptPolicy(0)">
                ยกเลิก
              </button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </tab-content>
</template>

<script lang="ts">
import { defineComponent, ref, reactive, onMounted, toRefs, watch } from "vue";
import ApiService from "@/core/services/ApiService";
// Import Dayjs
import dayjs from "dayjs";
import "dayjs/locale/th";
import buddhistEra from "dayjs/plugin/buddhistEra";
dayjs.extend(buddhistEra);
// Import FormWizard
import { TabContent } from "vue3-form-wizard";
// Import Modal Bootstrap
import { Modal } from "bootstrap";

import useBasicData from "@/composables/useBasicData";
import useMasterData from "@/composables/useMasterData";

export default defineComponent({
  name: "complaint-form-tab3",
  props: {
    complaint_type: {
      type: Object,
      required: true,
    },
    complaint_item: {
      type: Object,
      required: true,
    },
    complainant_item: {
      type: Object,
      required: true,
    },
    accused: {
      type: Object,
      required: true,
    },
    tab_index: {
      type: Number,
      required: true,
    },
    r: {
      type: String,
      required: true,
    },
  },
  components: {
    dayjs,
    TabContent,
  },
  setup(props, { emit }) {
    // UI
    const policyModalRef = ref<any>(null);
    const policyModalObj = ref<any>(null);

    // Variable
    const { tab_index, complaint_item, complainant_item } = toRefs(props);

    const policy_checkbox_tab = ref<boolean>(false);

    const selectOptions = ref({
      complaint_channels: <any>[],
      card_types: useBasicData().card_types,
      is_anonymouses: useBasicData().is_anonymouses,
    });

    const complaint_file_attach = reactive<any>([]);

    // Fetch
    const fetchComplaintFileAttach = async () => {
      try {
        const { data } = await ApiService.query("complaint-file-attach/", {
          params: { secret_key: props.r },
        });
        Object.assign(complaint_file_attach, data.data);
      } catch (error) {
        console.log(error);
      }
    };

    // Mounted
    const previewCardPhoto = ref<any>(null);
    const new_item = reactive<any>({
      is_anonymous: null,
      birthday: null,
      organization_all: [],
      markerDetails: { id: 1, position: { lat: null, lng: null } },
      complaint_channel_all: "",
      card_type: null,
      evidence_url: [],
    });

    const beforeShowTab = () => {
      fetchComplaintFileAttach();

      new_item.complaint_channel_all = "";
      if (complaint_item.value.complaint_channel_all.length > 0) {
        props.complaint_item.complaint_channel_all.forEach((el: any) => {
          let comma_text = " , ";
          if (new_item.complaint_channel_all.length == 0) {
            comma_text = "";
          }
          new_item.complaint_channel_all =
            new_item.complaint_channel_all +
            comma_text +
            selectOptions.value.complaint_channels[el - 1].name_th;
        });
      }

      new_item.is_anonymous = selectOptions.value.is_anonymouses.find(
        (x: any) => {
          return x.value == complaint_item.value.is_anonymous;
        }
      );

      if (complainant_item.value.card_photo.length != 0) {
        previewCardPhoto.value = URL.createObjectURL(
          complainant_item.value.card_photo
        );
      } else {
        previewCardPhoto.value = null;
      }

      new_item.birthday = complainant_item.value.birthday
        ? dayjs(complainant_item.value.birthday)
            .locale("th")
            .format("DD MMMM BBBB")
        : "";

      // Get Incident Date
      new_item.incident_date = complaint_item.value.incident_datetime
        ? dayjs(complaint_item.value.incident_datetime)
            .locale("th")
            .format("DD MMMM BBBB")
        : "";

      // Get Incident Time
      if (complaint_item.value.incident_time) {
        let prefix_hours = "";
        let prefix_minutes = "";
        if (complaint_item.value.incident_time.hours.length == 1) {
          prefix_hours = "0";
        }
        if (complaint_item.value.incident_time.minutes.length == 1) {
          prefix_minutes = "0";
        }

        new_item.incident_time =
          "เวลา " +
          prefix_hours +
          complaint_item.value.incident_time.hours +
          ":" +
          prefix_minutes +
          complaint_item.value.incident_time.minutes +
          " น.";
      }

      new_item.day_time = complaint_item.value.day_time
        ? "(" + complaint_item.value.day_time.name + ")"
        : "";

      if (
        complaint_item.value.location_coordinates != "" &&
        complaint_item.value.location_coordinates != null
      ) {
        const [lat, lng] = complaint_item.value.location_coordinates.split(",");
        new_item.markerDetails = {
          id: 1,
          position: { lat: Number(lat), lng: Number(lng) },
        };
      }

      new_item.evidence_url =
        complaint_item.value.evidence_url != "" &&
        complaint_item.value.evidence_url != null
          ? complaint_item.value.evidence_url
              .split(",")
              .map((it: any) => it.replace(/(^'|'$)/g, ""))
          : [];
    };

    // Event

    const onPolicyModal = () => {
      policyModalObj.value.show();
    };

    const onAcceptPolicy = (value: number) => {
      // checkbox
      if (value == 1) {
        policy_checkbox_tab.value = true;
        emit("change-policy", true);
        policyModalObj.value.hide();
      } else {
        policy_checkbox_tab.value = false;
        emit("change-policy", false);
        policyModalObj.value.hide();
      }
    };

    onMounted(async () => {
      policyModalObj.value = new Modal(policyModalRef.value, {});

      selectOptions.value.complaint_channels =
        await useMasterData().fetchComplaintChannel({
          is_active: 1,
          perPage: 500,
        });

      beforeShowTab();
    });

    // Watch
    watch(
      () => tab_index.value,
      () => {
        beforeShowTab();
      }
    );
    // onCalulate

    // Return
    return {
      selectOptions,
      new_item,
      policy_checkbox_tab,
      previewCardPhoto,
      complaint_file_attach,
      onAcceptPolicy,
      onPolicyModal,
      policyModalRef,
    };
  },
});
</script>

<style scoped>
.vs__dropdown-toggle {
  border: none;
}

.v-select {
  padding: 0.4em 0.5em;
}

.dp__main {
  padding: 0.35em 0em;
}

.dp__input {
  border: none !important;
}
@media only screen and (max-width: 768px) {
  .card > .card-body {
    padding: 0px;
  }
}

.form-check-input-custom {
  border-radius: 0.45em;
  border-color: #1b84ff;
  border-width: 2px;
}

.form-check-input-custom:disabled {
  pointer-events: none;
  filter: none;
  opacity: 1;
}

.form-check-input-custom:disabled {
  color: var(--bs-gray-500);
  background-color: none !important;
  border-color: #1b84ff;
  opacity: 1;
}

.form-check-input[disabled] ~ .form-check-label,
.form-check-input:disabled ~ .form-check-label {
  opacity: 1;
}

.color-primary {
  color: #800001;
}

.ti-2 {
  text-indent: 3em;
  text-align: justify;
  text-justify: inter-word;
}
</style>
